brew "atom"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "ack"
brew "autoconf"
brew "automake"
brwe "coreutils"
brew "curl"
brew "diff-so-fancy"
# https://github.com/so-fancy/diff-so-fancy
# git config --global core.pager "diff-so-fancy | less --tabs=4 -RFX"
# git config --global interactive.diffFilter "diff-so-fancy --patch"
brew "dsh"
brew "findutils"
brew "ffmpeg"
brew "gettext"
brew "git"
brew "gnu-sed"
brew "gnu-tar"
brew "gnu-indent"
brew "gnu-which"
# brew "golang"
brew "gpg"
# brew "httpie"
brew "iterm2"
brew "jq"
brew "jpegoptim"
brew "libjpeg"
brew "libmemcached"
brew "make"
brew "memcached"
brew "nmap"
brew "npm"
brew "nvm"
brew "node"
brew "openjdk@8" # needs sudo ln -sfn /opt/homebrew/opt/openjdk/libexec/openjdk.jdk /Library/Java/JavaVirtualMachines/openjdk.jdk
brew "optipng"
brew "pkg-config"
brew "python3"
brew "pypy3"
brew "screen", args: ["build-from-source"] # install from source for truecolor support
brew "ssh-copy-id"
# brew "stripe/stripe-cli/stripe"
brew "vim"
brew "watch"
brew "wget"

# GUI apps
# via brew install --cask
# https://formulae.brew.sh/cask/
# cask "arq"
# cask "atom"
# cask "cyberduck"
cask "docker"
# cask "dropbox"
cask "firefox"
cask "gas-mask"
cask "google-chrome"
# cask "karabiner-elements"
# cask "lastpass"
# cask "nordvpn"
# cask "obsidian"
# cask "quicksilver"
cask "sequel-ace"
cask "slack"
cask "spotify"
cask "visual-studio-code"
cask "vlc"
